# 오타는 당대에 발견되지 않는다.
# 오타는 실력이 확정되고 오타를 무수히 내고 에러를 무수히 내야 내 실력이 된다. 
# 입문자는 문제를 잘 해결 못함.오히려 일을 키움
# 하지만 좋은 도구를 사용하지 않음.
# 중급자는 문제를 잘 해결함.
# 하지만 좋은 도구를 사용함.

print 
# 프린트 함수는 데이터를 확인할 수 있는 가장 대표적이고 센놈 = console.log랑 같음.

a = 1
b = 2 
c = 3
d = 4
e = 5
f = 6
print('a', a);
# 여기다가 했더니 1이 나옴.


g = 7
print('a', a);
# 이쯤에다가 했더니 또 8이 나옴.

a = 8
# 그럼 얘가 문제가 있다는것.
# 이런식으로 확인해서 찾아야됨.반으로 잘라가면서.

print('a', a);
# 이쯤에다가 했더니 또 8이 나옴.
h = 9
i = 8
j = 7
k = 6
l = 5
m = 4
n = 3
o = 2
p = 1

print('a', a);
print(a);
# 이게뭔일임? 변수 a를 출력했는데 1이 아니라 8이 나옴.
# a빼고 밑에 있는 것들 중에 a를 바꾸는 무언가가 있음. 


# -----------------------------------------------



a = 1
b = 2 
c = 3
d = 4
e = 5
f = 6
g = 7
a = 2
h = 9
i = 8
j = 7
k = 6
l = 5
m = 4
n = 3
o = 2
p = 1
print(a);
#왼쪽에 run and debug 써라.
#숫자 앞에 빨간점 브레이킹을 걸고 디버그 시작하면됨.
#화면 시작되서 화살표 뜨면 저기까지만 디버깅을 했다는 소리임.
